Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services_for_older_people/home_care_packages_for_carers.html.txt.tmx
Source language: en
Languages: ga

source: The Health Service Executive (HSE) has responsibility for the delivery of public health community and home care supports at local level, including the Home Care Package scheme
ga: Tá Feidhmeannacht na Seirbhíse Sláinte (FSS) freagrach as tacaí cúram baile agus sláinte an phobail a sheachadadh ag an leibhéal áitiúil

source: What is the Home Care Package scheme?
ga: Cad atá i gceist leis an Scéim Tacaíochta Cúram Baile?

source: The Home Care Package (HCP) scheme is an administrative scheme, operated by the HSE
ga: Is scéim riaracháin í an Scéim Tacaíochta Cúram Baile (ar a dtugtar An Pacáiste Tacaíochta Cúram Baile freisin), atá á oibriú ag FSS

source: It aims to help people who need medium to high caring support to continue to live at home independently
ga: Tá an scéim dírithe go príomha orthu siúd óna dteastaíonn tacaíocht cúraim meánleibhéil nó ardleibhéil chun cur ar a gcumas cónaí sa bhaile go neamhspleách

source: The Home Care Package scheme is not established in law; as it is an administrative scheme, you do not have an automatic right to the scheme, or to avail of services under the scheme
ga: Níl an Scéim Tacaíochta Cúram Baile bunaithe de réir an dlí, os rud é gur scéim riaracháin atá ann níl ceart uathoibríoch agat ar an Scéim ná chun sochar a bhaint as seirbhísí faoin scéim

source: The HSE operates national guidelines on how to qualify for the HCP scheme
ga: Déanann roinnt Limistéar Riaracháin FSS measúnú ar ioncam ar an mbunús céanna le cártaí leighis

source: The scheme is not means tested, and there is no charge or contribution to be paid for the services provided
ga: Seiceáil le d’Oifig Sláinte Áitiúil chun tuilleadh sonraí a fháil maidir leis an gcaoi a bhfeidhmíonn an Scéim i do cheantar

source: Each HSE Area has responsibility for the operation of the scheme within the resources allocated for it in that area
ga: Tá gach Limistéar Riaracháin FSS freagrach as a Scéim féin a fheidhmiú

source: This means that the level of service or support you receive as part of a HCP may vary in different parts of the country depending on the local population, your individual needs, who is available to deliver services and the demand for the scheme. Check with your Local Health Office for more details on the scheme in your area
ga: Ciallaíonn sé seo go bhfuil difríochtaí idir na Scéimeanna i gcodanna éagsúla den tír, ag brath ar an bpobal áitiúil, do riachtanais phearsanta, an pearsanra atá ar fáil chun seirbhísí a sheachadadh agus an t-éileamh i do cheantar féin

source: What does the Home Care Package scheme consist of?
ga: Cad atá sa Scéim Tacaíochta Cúram Baile?

source: Each support package is tailored to your individual needs
ga: Cuirtear gach pacáiste tacaíochta in oiriúint dod’ riachtanais aonair

source: The package may include the services of nurses, home helps and various therapies including physiotherapy and occupational therapy services
ga: Go ginearálta, cuimsíonn siad seirbhísí altraí, freastalaithe cúram baile, cúntóirí baile agus na teiripí éagsúla lena gcuimsítear seirbhísí fisiteiripe agus seirbhísí teiripe shaothair

source: You might also receive some respite care or aids or appliances as part of your HCP if these are needed to support you to stay in your own home
ga: Beidh do phacáiste pearsanta ag brath ar do riocht leighis agus ar an leibhéal cúraim a theastaíonn uait

source: The services that are supplied will depend on your needs, as assessed by the HSE, and the levels of other supports available to you, such as family members or friends
ga: Mar shampla, d’fhéadfadh níos mó béime a bheith ar fhreastalaithe cúram baile i bpacáistí áirithe agus d’fhéadfadh leibhéal níos airde teiripe agus altranais a bheith ag teastáil i bpacáistí eile, ag brath ar riachtanais an duine aonair

source: Your individual Package will vary according to your medical condition, the level of care required and the supports you already have available to you
ga: I gcodanna áirithe den tír, cuireann FSS seirbhísí faoin Scéim ar fáil go díreach; i gcodanna eile, beidh seirbhísí i gceist arna soláthar ag eagraíochtaí nó ag grúpaí deonacha thar ceann FSS

source: For example, there might be a greater emphasis in some Packages on home help services (personal and/or domestic care) while other Packages may require a greater level of therapy and nursing, depending on individual need
ga: D’fhéadfadh deontais airgid thirim a bheith i gceist le pacáistí freisin, chun cur ar chumas theaghlach an othair réimse seirbhísí nó tacaí a cheannach go díreach

source: The HSE may provide a Home Care Package as a short-term arrangement, for example, when you are recovering following a stay in hospital, during an illness or while you are recuperating
ga: I gcodanna áirithe den tír, d’fhéadfadh meascán de sheirbhísí díreacha agus íocaíochtaí in airgead tirim a bheith i gceist leis an bpacáiste

source: Who is the Home Care Package scheme for?
ga: Cé ar a bhfuil an Scéim Tacaíochta Cúram Baile dírithe?

source: The main priority of the HCP scheme is older people living in the community or who are in-patients in acute hospitals and at risk of admission to long-term care
ga: Is í an phríomhthosaíocht atá ag an Scéim Tacaíochta Cúram Baile ná daoine scothaosta atá ina gcónaí sa phobal nó othair cónaitheacha in ospidéil ghéarmhíochaine atá i mbaol a bheith glactha isteach i gcúram fadtéarmach

source: Home Care Packages may also be available to those older people who have been admitted to long-term care and who can (with support), return to the community
ga: D’fhéadfadh pacáistí cúram baile a bheith ar fáil freisin do dhaoine scothaosta a ghlactar isteach i gcúram fadtéarmach agus ar féidir leo (le tacaíocht) filleadh ar an bpobal

source: Packages may also be offered to people who are already using existing care services, such as home helps, but who may need more assistance to continue to live in their community
ga: D’fhéadfaí pacáistí a thairiscint dóibh siúd atá ag úsáid seirbhísí lárnacha atá ann cheana féin, cosúil le cúntóirí baile, ach go dteastaíonn tuilleadh cúnaimh uathu chun go mbeidh ar a gcumas leanúint ag cónaí ina bpobal

source: Home Care Packages may also be available occasionally for younger people whose needs would be best met by access to older people's services, for example, in the situation of early-onset dementia
ga: D’fhéadfadh pacáistí Cúram Baile a bheith ar fáil freisin do dhaoine óga a bhfuil tinneas ainsealach ag dul dóibh agus do dhaoine eile a d’fhéadfadh maireachtáil sa bhaile chomh fada is go mbeadh tacaíocht leordhóthanach acu

source: How does a Home Care Package work?
ga: Conas a oibríonn pacáiste Tacaíochta Cúram Baile?

source: The type of Package available will depend on the needs of the individual concerned
ga: Seiceáil ar dtús an bhfuil an Scéim ag feidhmiú i do cheantar nó nach bhfuil

source: In the meantime the HSE has implemented an interim approach to the standard assessment of the needs of people who apply for this scheme
ga: Beidh an cineál pacáiste Tacaíochta a bheidh ar fáil ag brath ar riachtanais an duine aonair atá i gceist

source: In most cases, your public health nurse will do a Care Needs Assessment and will work out with you and your family how your needs would be most appropriately met
ga: Tá réimse (timpeall sé nó seacht gcinn) pacáistí éagsúla ar fáil. Tá FSS i mbun oibre ar mheasúnú riachtanas náisiúnta chun gach duine aonair a chaighdeánú

source: The general rule is that if you need more than 5 hours' home help service per week, you can apply to be considered for a HCP
ga: Idir an dá linn, áfach, níl aon mheasúnú caighdeánach ann maidir le riachtanais na ndaoine a chuireann isteach ar an Scéim seo, agus níl aon rialacha ann maidir leis an mbealach ina ndéanfar aon mheasúnú

source: The number of hours and types of support or services approved by the HSE will again depend on your individual needs
ga: I bhformhór na gcásanna, déanfaidh d’altra sláinte poiblí measúnú ar do riachtanais cúraim agus socróidh sé/sí leat féin agus le do theaghlach conas is fearr a dhéanfar do riachtanais a chomhlíonadh

source: Services may be provided by the HSE directly, or by certain non-HSE providers. These are voluntary (not for profit) and private (for profit) organisations that have been approved by the HSE to provide Home Care Packages
ga: I gcodanna áirithe den tír, is í an riail ghinearálta ná sa chás go dteastaíonn os cionn 10 n-uair an chloig cúraim in aghaidh na seachtaine ó dhuine, gur féidir leo cur isteach ar an scéim seo

source: The non-HSE providers have been assessed by the HSE as demonstrating that they could achieve new minimum standards required on its behalf
ga: Beidh an líon uaireanta tacaíochta a chuireann FSS ar fáil ag brath ar do riachtanais aonair

source: A Care Needs Assessment identifies your overall health needs and your level of dependency
ga: D’fhéadfadh FSS seirbhísí a chur ar fáil go díreach, nó d’fhéadfadh eagraíochtaí pobail nó deonacha iad a chur ar fáil thar ceann FSS

source: It will be done by a health care worker, such as, for example, a public health nurse or physiotherapist etc
ga: I gcásanna áirithe, féadfaidh tú cúramóir príobháideach nó seirbhís cúntóra baile a fhostú

source: •Your ability to carry out the activities of daily living, for example, bathing, shopping, dressing and moving around
ga: Sa chás seo, beidh tusa mar fhostóir ag an duine sin, agus mar fhostóir, beidh dualgais agus oibleagáidí áirithe agat

source: •Your family, social and community supports
ga: Tá FSS ag obair i gcomhar le roinnt ranna rialtais eile chun scrúdú a dhéanamh ar shaincheisteanna eile a bhaineann le Tacaíochtaí Cúraim Baile

source: •Your wishes and preferences
ga: Mar shampla, tá obair ar siúl faoi láthair leis an Roinn Sláinte, an Roinn Coimirce Sóisialaí agus an Roinn Comhshaoil, Pobal agus Rialtais Áitiúil chun a chinntiú go bhfuil na pacáistí atá á seachadadh solúbtha agus go gcuimsíonn siad íocaíocht struchtúrtha in airgead tirim agus tacaí eile

source: The assessment may include a physical examination by a healthcare professional. A report will be prepared to record your care needs and a copy can be provided to you
ga: Tá FSS ag obair i gcomhar leis an Roinn Comhshaoil agus an Roinn Coimirce Sóisialaí lena chinntiú go dtógtar saincheisteanna tithíochta agus saincheisteanna tacaíochta ioncaim san áireamh nuair a bhítear ag pleanáil do riachtanais othair agus teaghlaigh sa todhchaí

source: Home Care Packages are tailored to meet individual needs. This means that services vary
ga: Tá Pacáistí Cúram Baile deartha chun riachtanais daoine aonair a chomhlíonadh

source: Typical packages of support available under the scheme may be worth between €350-500 per week in respect of each patient, depending on individual need
ga: Ciallaíonn sé seo go bhfuil éagsúlachtaí idir na seirbhísí agus d’fhéadfadh sé gur fiú €350-€500 in aghaidh na seachtaine na gnáth-phacáistí tacaíochta atá ar fáil faoin Scéim do gach othar, ag brath ar riachtanas an duine aonair

source: As outlined above, the Package may consist of:
ga: Mar a léirítear thuas, d’fhéadfadh an Pacáiste a bheith comhdhéanta de:

source: • Services provided directly by the HSE, or
ga: • Seirbhísí atá á gcur ar fáil go díreach ag FSS, nó

source: • Services provided on behalf of the HSE by a non-HSE provider, or
ga: • Íocaíocht dhíreach sheachtainiúil ó FSS chun cur ar do chumas seirbhísí a cheannach go príobháideach, nó

source: • A combination of the above
ga: • Meascán díobh sin thuas

source: However, if you arrange services or supports above the levels provided by the HSE or if you do not qualify for a Home Care Package you will have to pay for the cost of those services yourself
ga: Má tá an íocaíocht sheachtainiúil le fáil agat, is féidir le d’Oifig Sláinte Áitiúil comhairle a chur ort maidir le conas dhéanfar an íocaíocht leat agus is féidir leis an Oifig comhairle a chur ort maidir le conas a dhéantar measúnú ar d’ioncam agus do mhaoin

source: If you employ someone in your home (such as a private carer) funded from your own resources, you become their employer
ga: Arís, níl aon treoirlínte náisiúnta ann maidir le conas a dhéantar measúnú ar ioncam

source: As an employer, you have various duties and obligations
ga: Mar fhostóir, tá dualgais agus oibleagáidí éagsúla agat

source: Revenue has a useful leaflet on the Domestic EmployerScheme (pdf)
ga: Tá bileog úsáideach ag na Coimisinéirí Ioncaim maidir leis an Scéim Fostóra Baile (pdf)

source: There are tax concessions if you pay part or all of the costs yourself
ga: Má íocann tú cuid de na costais nó na costais go léir ó d’acmhainní féin, is féidir leat sochar a bhaint as lamháltais chánach

source: You can download the application form (pdf) and the information booklet (pdf) for the scheme or you can obtain copies from your Local Health Office
ga: Téigh i dteagmháil le d’altra sláinte poiblí chun measúnú riachtanas a fháil, nó d’Oifig Sláinte Áitiúil chun tuilleadh eolais a fháil faoin bPacáiste Tacaíochta Cúram Baile agus an próiseas iarratais atá i gceist

source: Your Local Health Office will provide any further information you need
ga: Cuirfidh an fhoireann oibre i d’Oifig Sláinte Áitiúil aon fhaisnéis bhreise a theastaíonn uait ar fáil duit
